import pandas as pd
import pytest

from src.reports import spending_by_category, spending_by_weekday
from tests.conftest import save_xlsx


def test_spending_by_category_date_now(freezer, save_xlsx):
    """ Тестирование работы функции, если дата не была задана """
    data = pd.DataFrame(
        [
            {"Дата операции": "10.11.2024 23:23:23", "Категория": "Фастфуд"},
            {"Дата операции": "09.09.2024 11:11:11", "Категория": "Перевод"},
            {"Дата операции": "09.09.2024 09:11:11", "Категория": "Фастфуд"}
        ]
    )
    freezer.move_to("11.11.2024")
    file = save_xlsx(data)
    result = spending_by_category(file, "Фастфуд")
    assert result == [
        {"Дата операции": "10.11.2024 23:23:23", "Категория": "Фастфуд"},
        {"Дата операции": "09.09.2024 09:11:11", "Категория": "Фастфуд"}
    ]


def test_spending_by_category_user_date(freezer, save_xlsx):
    """ Тестирование функции с заданной датой """
    data = pd.DataFrame(
        [
            {"Дата операции": "10.11.2024 23:23:23", "Категория": "Фастфуд"},
            {"Дата операции": "09.09.2024 11:11:11", "Категория": "Перевод"},
            {"Дата операции": "09.09.2024 09:11:11", "Категория": "Фастфуд"},
            {"Дата операции": "08.09.2024 11:11:11", "Категория": "Перевод"},
            {"Дата операции": "07.09.2024 09:11:11", "Категория": "Фастфуд"},
            {"Дата операции": "10.06.2024 09:11:11", "Категория": "Фастфуд"}
        ]
    )
    freezer.move_to("11.11.2024")
    file = save_xlsx(data)
    result = spending_by_category(file, "Фастфуд", "08.09.2024")
    assert result == [
        {"Дата операции": "07.09.2024 09:11:11", "Категория": "Фастфуд"},
        {"Дата операции": "10.06.2024 09:11:11", "Категория": "Фастфуд"}
    ]


def test_spending_by_category_no_category(freezer, save_xlsx):
    """ Тестирование функции если категории нет в операциях в DF """
    data = pd.DataFrame(
        [
            {"Дата операции": "10.11.2024 23:23:23", "Категория": "Фастфуд"},
            {"Дата операции": "09.09.2024 11:11:11", "Категория": "Перевод"},
            {"Дата операции": "09.09.2024 09:11:11", "Категория": "Фастфуд"},
            {"Дата операции": "08.09.2024 11:11:11", "Категория": "Перевод"},
            {"Дата операции": "07.09.2024 09:11:11", "Категория": "Фастфуд"},
            {"Дата операции": "10.06.2024 09:11:11", "Категория": "Фастфуд"}
        ]
    )
    freezer.move_to("11.11.2024")
    file = save_xlsx(data)
    result = spending_by_category(file, "Супермаркет")
    assert result == []



def test_spending_by_category_no_file():
    """ Тестирование ошибки, если файл не найден """
    with pytest.raises(FileNotFoundError, match="Файл не найден"):
        spending_by_category("operations.xlsx", "Супермаркет", "08.09.2024")


def test_spending_by_category_incorrect_content(save_xlsx):
    """ Тестирование ошибки, при передаче файла с некорректным форматом содержимого """
    data = pd.DataFrame([{"Имя": "Иван"},{"Имя": "Алиса"}])
    file = save_xlsx(data)
    with pytest.raises(ValueError, match="Не верный формат данных"):
        spending_by_category(file, "Супермаркет", "08.09.2024")


def test_spending_by_weekday_date_now(freezer, save_xlsx):
    """ Тестирование работы функции, если дата не была задана """
    data = pd.DataFrame(
        [
            {"Дата операции": "10.11.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "09.11.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "08.11.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
            {"Дата операции": "07.11.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "06.11.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "05.11.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "04.11.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "03.11.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "01.11.2024 11:11:11", "Сумма операции": -28.34, "Статус": "OK"},
            {"Дата операции": "31.10.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
            {"Дата операции": "30.10.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "29.10.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "28.10.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "27.10.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
        ]
    )
    freezer.move_to("11.11.2024")
    file = save_xlsx(data)
    result = spending_by_weekday(file)
    assert result == [
        {'Воскресенье': 236.68,
          'Вторник': 236.68,
          'Понедельник': 236.68,
          'Пятница': 157.63,
          'Среда': 236.68,
          'Суббота': -0.0,
          'Четверг': 261.81}
    ]


def test_spending_by_weekday_user_date(freezer, save_xlsx):
    data = pd.DataFrame(
        [
            {"Дата операции": "09.11.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "08.09.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
            {"Дата операции": "06.09.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "05.08.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "04.08.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "31.05.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
        ]
    )
    file = save_xlsx(data)
    result = spending_by_weekday(file, "09.09.2024")
    assert result == [
        {'Воскресенье': 286.93,
          'Вторник': -0.0,
          'Понедельник': 236.68,
          'Пятница': -0.0,
          'Среда': -0.0,
          'Суббота': -0.0,
          'Четверг': -0.0}
    ]


def test_spending_by_weekday_no_operation_these_dates(freezer, save_xlsx):
    data = pd.DataFrame(
        [
            {"Дата операции": "09.11.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "08.09.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
            {"Дата операции": "06.09.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "05.08.2024 23:23:23", "Сумма операции": -236.68, "Статус": "OK"},
            {"Дата операции": "04.08.2024 11:11:11", "Сумма операции": 15000, "Статус": "OK"},
            {"Дата операции": "31.05.2024 09:11:11", "Сумма операции": -286.93, "Статус": "OK"},
        ]
    )
    file = save_xlsx(data)
    result = spending_by_weekday(file, "30.05.2024")
    assert result == [
        {'Воскресенье': -0.0,
          'Вторник': -0.0,
          'Понедельник': -0.0,
          'Пятница': -0.0,
          'Среда': -0.0,
          'Суббота': -0.0,
          'Четверг': -0.0}
    ]



def test_spending_by_weekday_no_file():
    """ Тестирование ошибки, если файл не найден """
    with pytest.raises(FileNotFoundError, match="Файл не найден"):
        spending_by_weekday("operations.xlsx", "08.09.2024")



def test_spending_by_weekday_incorrect_content(save_xlsx):
    """ Тестирование ошибки, при передаче файла с некорректным форматом содержимого """
    data = pd.DataFrame([{"Имя": "Иван"},{"Имя": "Алиса"}])
    file = save_xlsx(data)
    with pytest.raises(ValueError, match="Не верный формат данных"):
        spending_by_weekday(file, "08.09.2024")
